In [1]:
import pandas as pd

# 1. 팬더스, 데이터 프레임, 시리즈 알아보기

In [7]:
filePath = '~/Git/DSSchool_Study/study/inflearn_pandas/lecture_material/data/'

data_frame = pd.read_csv(filePath + 'friend_list.csv')
data_frame.tail(2)

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

In [8]:
type(data_frame.name)

pandas.core.series.Series

In [9]:
list_tmp = [1, 2, 3]

In [12]:
series1 = pd.core.series.Series(list_tmp)

In [13]:
series2 = pd.core.series.Series(['one', 'two', 'three'])

In [14]:
pd.DataFrame(data=dict(num=series1, word=series2))

   num   word
0    1    one
1    2    two
2    3  three

# 2. 파일에서 데이터 불러오기

In [17]:
df = pd.read_csv(filePath + 'friend_list_tab.txt')
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [18]:
df = pd.read_csv(filePath + 'friend_list_tab.txt', delimiter = '\t')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

- 파일 내용이 쉼표(',') 가 아닌 다른것들(ex. \t)로 구분되어져 있을때는 `delimiter`를 명시해서 알려주기

### - header가 없는 경우

In [19]:
df = pd.read_csv(filePath + 'friend_list_no_head.csv')
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [24]:
df = pd.read_csv(filePath + 'friend_list_no_head.csv', header = None)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [22]:
df.columns = ['name', 'age', 'job']
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [25]:
df = pd.read_csv(filePath + 'friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

# 3. 데이터 프레임 생성하기

In [26]:
friend_dict_list = [
    {'name':'John', 'age': 25, 'job': 'student'},
    {'name':'Nate', 'age': 30, 'job': 'teacher'}
]

In [27]:
df = pd.DataFrame(friend_dict_list)
df.head()

   age      job  name
0   25  student  John
1   30  teacher  Nate

In [28]:
from collections import OrderedDict

In [30]:
friend_ordered_dict = OrderedDict(
    [
        ('name', ['John', 'Nate']),
        ('age', [25, 30]),
        ('job', ['student', 'teacher'])
    ]
)

In [31]:
df = pd.DataFrame.from_dict(friend_ordered_dict)
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [32]:
friend_list = [
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher']
]

column_name = ['name', 'age', 'job']

In [34]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [76]:
friend_list = [
    ['name', ['John', 'Nate']],
    ['age', [25, 30]],
    ['job', ['student', 'teacher']]
]

In [77]:
df = pd.DataFrame.from_items(friend_list)
df.head()

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

   name  age      job
0  John   25  student
1  Nate   30  teacher

# 로우 선택하기

In [78]:
friend_list = [ 
                ['name',['John', 'Jenny', 'Nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:6: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.

In [44]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [45]:
df.loc[[0, 2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [46]:
df_filtererd = df[(df.age > 25) & (df.name == 'Nate')]

In [47]:
df_filtererd

   name  age      job
2  Nate   30  teacher

In [48]:
df.iloc[:, 0:2]

    name  age
0   John   20
1  Jenny   30
2   Nate   30

In [51]:
df.iloc[:, [0, 2]]

    name        job
0   John    student
1  Jenny  developer
2   Nate    teacher

# filtering

In [55]:
df_filtered = df[['name', 'age']]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30

In [56]:
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher

In [60]:
df.filter(like='1', axis=0)

    name  age        job
1  Jenny   30  developer

In [61]:
df.filter(like='g', axis=1)

   age
0   20
1   30
2   30

In [63]:
df.filter(regex='b$', axis=1)

         job
0    student
1  developer
2    teacher

# drop row, column

In [79]:
df.index = df['name']

In [80]:
df.drop(['John', 'Nate'])

        name  age        job
name
Jenny  Jenny   30  developer

In [81]:
df.drop(['John', 'Nate'], inplace = True)
df

        name  age        job
name
Jenny  Jenny   30  developer

- inplace 는 df = df.drop[~] 으로 대입하지 않아도 원본에 자동으로 값이 들어가게 함.

In [100]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30    teacher   Nate

In [86]:
df = df.drop(df.index[[0, 2]])
df

   age        job   name
1   30  developer  Jenny

In [89]:
df[df.age > 20]

   age        job   name
1   30  developer  Jenny
2   30    teacher   Nate

In [90]:
df.drop('age', axis=1)

         job   name
0    student   Jone
1  developer  Jenny
2    teacher   Nate

- axis = 0: row
- axis = 1: column

# 행, 열 생성 및 수정하기

In [92]:
df['salary'] = 0

In [93]:
df

   age        job   name  salary
0   20    student   Jone       0
1   30  developer  Jenny       0
2   30    teacher   Nate       0

In [94]:
import numpy as np

In [107]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')
df

   age        job   name salary
0   20    student   Jone     no
1   30  developer  Jenny    yes
2   30    teacher   Nate    yes

In [105]:
df['salary'] = 'no'
df

   age        job   name salary
0   20    student   Jone     no
1   30  developer  Jenny     no
2   30    teacher   Nate     no

In [106]:
df.loc[df['job'] != 'student', 'salary'] = 'yes'
df

   age        job   name salary
0   20    student   Jone     no
1   30  developer  Jenny    yes
2   30    teacher   Nate    yes

In [132]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])

In [110]:
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [111]:
df['total'] = df['midterm'] + df['final']

In [112]:
df

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       10     30     40

In [113]:
df['average'] = df['total'] / 2

In [114]:
df

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       10     30     40     20.0

In [119]:
df['average']

0    90.0
1    82.5
2    20.0
Name: average, dtype: float64

In [124]:
grades = []
for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F')
        
df['grade'] = grades

In [125]:
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       10     30     40     20.0     F

In [126]:
def pass_or_fail(row):
    if row != 'F':
        return 'Pass'
    else:
        return 'Fail'

In [127]:
df.grade = df.grade.apply(pass_or_fail)

In [128]:
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       10     30     40     20.0  Fail

In [129]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [130]:
def extract_year(row):
    return row.split('-')[0]

In [131]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [133]:
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [134]:
df2 = pd.DataFrame([
    ['Ben', 50, 50]
], columns = ['name', 'midterm', 'final'])
df2

  name  midterm  final
0  Ben       50     50

In [137]:
df.append(df2)

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30
0    Ben       50     50

In [138]:
df.append(df2, ignore_index = True)

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30
3    Ben       50     50

# 데이터 그룹 만들기